function shashui(id){
	//var target = event.target || event.srcElement;
	//var id = target.id
	//alert(id)
	var a = id.split("_")
	var shan = a[1]
	//alert(shan)
	switch (shan){
		case "11":
		//alert(shan)
		//alert(renshan_shui + renshan_sha)
			document.getElementById("shashui_comm").innerHTML = renshan_shui + "<p>" + renshan_sha
			break;
		case "12":
			document.getElementById("shashui_comm").innerHTML = zishan_shui + "<p>" + zishan_sha
			break;
		case "13":
			document.getElementById("shashui_comm").innerHTML = guishan_shui + "<p>" + guishan_sha
			break;
			
		case "21":
			document.getElementById("shashui_comm").innerHTML = weishan_shui + "<p>" + weishan_sha
			break;
		case "22":
			document.getElementById("shashui_comm").innerHTML = kunshan_shui + "<p>" + kunshan_sha
			break;
		case "23":
			document.getElementById("shashui_comm").innerHTML = shenshan_shui + "<p>" + shenshan_sha
			break;
			
		case "31":
			document.getElementById("shashui_comm").innerHTML = jiashan_shui + "<p>" + jiashan_sha
			break;
		case "32":
			document.getElementById("shashui_comm").innerHTML = maoshan_shui + "<p>" + maoshan_sha
			break;
		case "33":
			document.getElementById("shashui_comm").innerHTML = yishan_shui + "<p>" + yishan_sha
			break;
		case "41":
			document.getElementById("shashui_comm").innerHTML = chenshan_shui + "<p>" + chenshan_sha
			break;
		case "42":
			document.getElementById("shashui_comm").innerHTML = xunshan_shui + "<p>" + xunshan_sha
			break;
		case "43":
			document.getElementById("shashui_comm").innerHTML = sishan_shui + "<p>" + sishan_sha
			break;
			
		case "61":
			document.getElementById("shashui_comm").innerHTML = xushan_shui + "<p>" + xushan_sha
			break;
		case "62":
			document.getElementById("shashui_comm").innerHTML = qianshan_shui + "<p>" + qianshan_sha
			break;
		case "63":
			document.getElementById("shashui_comm").innerHTML = haishan_shui + "<p>" + haishan_sha
			break;	
		case "61":
			document.getElementById("shashui_comm").innerHTML = xushan_shui + "<p>" + xushan_sha
			break;
		case "62":
			document.getElementById("shashui_comm").innerHTML = qianshan_shui + "<p>" + qianshan_sha
			break;
		case "63":
			document.getElementById("shashui_comm").innerHTML = haishan_shui + "<p>" + haishan_sha
			break;
		case "71":
			document.getElementById("shashui_comm").innerHTML = gengshan_shui + "<p>" + gengshan_sha
			break;
		case "72":
			document.getElementById("shashui_comm").innerHTML = youshan_shui + "<p>" + youshan_sha
			break;
		case "73":
			document.getElementById("shashui_comm").innerHTML = xinshan_shui + "<p>" + xinshan_sha
			break;
		case "81":
			document.getElementById("shashui_comm").innerHTML = choushan_shui + "<p>" + choushan_sha
			break;
		case "82":
			document.getElementById("shashui_comm").innerHTML = genshan_shui + "<p>" + genshan_sha
			break;
		case "83":
			document.getElementById("shashui_comm").innerHTML = yinshan_shui + "<p>" + yinshan_sha
			break;
			
		case "91":
			document.getElementById("shashui_comm").innerHTML = bingshan_shui + "<p>" + bingshan_sha
			break;
		case "92":
			document.getElementById("shashui_comm").innerHTML = wushan_shui + "<p>" + wushan_sha
			break;
		case "93":
			document.getElementById("shashui_comm").innerHTML = dingshan_shui + "<p>" + dingshan_sha
			break;	
	}
}

var renshan_shui = "壬山有水：\
壬水没儿郎 先绝是二房。\
形如一箭去 小口命难长。\
形如葫芦样 亦主腰脘伤。\
四季澄清蓄 尤主淋卵囊。\
解说：壬山有水主中男无子，有子易伤残死亡，水形象箭一样孩子易夭亡。如水形象葫芦，中男腰有伤，或身体不好有残疾或常年有病，此位如有清水常年囤积往往造成中男生殖系统有病或许性病，或肾亏。\
"
var zishan_shui = "子山有水：\
子水一条沟 流去不回头。\
无子身逃外 凶死一笔勾。\
形如项托袋 妇女把命休。\
子山有一条水沟直冲，中男贫困且没有孩子容易出突发性灾难，到异地发展客死他乡。子山水形好像盛满米的袋子，中男的妻子身体不好或短命。\
<p>坎一宫有水：\
一白是汪洋 流若通两旁。\
流乾老父乖 流艮俊儿郎。\
聪明怕自误 身体算不强。\
流若通巽位 绝世长二房。\
形如七桠叉 财产不绵长。\
一白指的是后天坎位。如果这方位大面积有水占据了后天乾位或后天艮位。要是占据了坎和乾位老父亲能干，可以帮助后代。要是占据了坎和艮位那么会生下漂亮的孩子而且知情达理学习好。这样的孩子很聪明，就是身体不好耽误学业。后天坎宫艮宫乾宫的水形不整齐，即便发财也不会长久。\
"
var guishan_shui = "癸山有水：\
癸水妇不育 常为夫羞辱。\
亦主黄鹤怨 孤灯独伴宿。\
形若不齐正 犹被教姑逐。\
形若一条枪 毒死夫常哭。\
癸山有水，中年妻子不孕，时常因此事犯口舌，此户人家有黄胆病或面皮黄，丈夫经常不回家，妻子深夜独眠，水形如果不齐整家中妻子和姑姐的关系不好，常常打架，水的形状象一条枪，会出现服毒，或在争吵中意外伤亡，丈夫因后悔而哭泣。\
"
var weishan_shui = "未山有水：\
未水出盗贼 事犯产没收。\
形若斜飞去 战场寻尸骨。\
未山有水会出现财务被盗现象或家中长期汇聚盗贼，家中经济状况比较富裕，因长期汇聚盗贼被查处财产全部没收，这个山位如有水成45度角流向它方，这样的风水环境不适合当兵，会死在战场上。\
"

var kunshan_shui = "坤山有水：\
坤水伤妻房 贤妇不久长。\
形若破军样 定主胀病亡。\
坤位见水贤惠的妻子会常年有病或短命，淫乱或心性恶毒的人却可以活着。如水形不整齐易患浮水，肿瘤的病。\
<p>坤二宫有水：\
二黑水当先 巫婆小姑仙。\
流神通丙午 儿郎死父前。\
水龙入兑位 阴邪一处眠。\
形如三叉口 飞刃妇身边。\
二黑讲的是后天坤位，这个卦位全是水，会出巫婆仙姑这样的人。如水从后天坤流到后天离宫就是离和坤全是水，那样中男要死在父亲前面，水从兑位流出就是水从西南方来向西方流去，这样的环境会家中出现闹鬼现象，水形好像三叉一样，这样环境会出现女孩喜欢打架，暴利，身上还会带凶器。\
"

var shenshan_shui = "申山有水：\
申水伤小女 亦主客路亡。\
形如团圆聚 定主是飞娘。\
申山位有水伤排行老三的女孩或三十岁以下或没结婚的女孩，容易出现交通事故或外出死亡。如水形为圆形，在这样风水里的女孩早恋，作风不正。\
"
var jiashan_shui = "甲山有水：\
甲水主贫穷 长房不兴隆。\
形若斜飞去 定主长绝踪。\
黄肿大等胀 都应长房宫。\
甲山有水这样的环境家境贫寒，排行老大的最明显。如水形斜飞去这样长房没有儿子，有儿子会更穷，要是有钱而且又有子，父子有早亡现象。这样的环境长房居住易出现肿胀浮水肝胆之病。\
"

var maoshan_shui = "卯山有水:\
卯水属同人 先富小财神。\
家物他人有 伯道在本身。\
形如方深聚 近时对城门。\
暂可不言凶 终究假与真。\
卯山有水犯桃花家中有钱。有领养孩子的现象或家产留给叔伯的孩子，如果卯方有水成方形或开门，这样的环境暂时会富裕不会大凶，时间常了会因桃花惹出是非。\
<p>\
震三宫有水：\
三碧沟塘破 其家定遭破。\
流神通巽地 宫飞依次过。\
艮水若交会 兄弟时目怒。\
三碧指后天东方震卦这个方位如有水，长男肯定破财发富不长久，水流到后天巽位老大的媳妇是二婚或行为不正之人，否则会有伤病。或者长男会与有夫之妇通奸。震水与艮水相连，兄弟之间不和睦。\
"

var yishan_shui = "乙山有水：\
乙水曲曲钩 叔嫂暗相偷。\
形如破军样 肝疯病不休。\
临卦主运乱 财富不到头。\
乙山有水，家出淫乱之人，水形不齐整排行老大的易患有肝病或胆病，流年到卯酉之年虽然发富也会破大财。\
"
var chenshan_shui = "辰山有水：\
辰水盗贼来 抄家并抢财。\
形若一条枪 命因恶死埋。\
形如塘三角 军贼命之该。\
形为都不正 抢劫开心怀。\
辰山有水家中被盗或有偷盗他人之事，形状好像一条枪容易出现被暗杀之事，形状若是三角形出土匪恶霸行为人品都不正，以抢劫为乐，这样的风水不得善终。\
"
var xunshan_shui = "巽山有水：\
巽水女淫乱 性偏爱老郎。\
形如鸭公脚 公媳共一床。\
形若飞斜去 私奔到异乡。\
口舌因此起 兴讼到公堂。\
后天巽卦有水，这样的风水出淫乱之人，喜欢岁数比自己大的男人，长女最明显。水的形状象鸭脚一样，主公爹和儿媳有不正当关系，水形斜飞这样的风水家妻易。\
<p>\
巽四宫有水：\
四绿满水汪 出人为匪狂。\
吃喝与嫖赌 贪恋将家亡。\
水若流入坎 必定抢余娘。\
水如流坤聚 个个伤妻房。\
流神通到乾 小女必为娼。\
最怕聚震位 儿郎往西方。\
四绿指的是后天巽位，常年有水出土匪，喜欢嫖赌将家财败尽，水从后天巽位流到坎位这样的风水会出寡妇，水从巽聚集到后天坤位这样的风水伤妻子，如果水从巽囤积到后天震位，这样孩子到外地发展，在家中常年有病。\
"
var sishan_shui = "巳山有水：\
巳水配秃郎 僧人入香房。\
夫若头无发 假夫假久长。\
形若七八桠 秦楼楚馆娘。\
巳山有水丈夫秃顶，若丈夫满头乌发其家中妻子与秃顶之人通奸或与僧人通奸。丈夫如果常年剔秃子，这样的夫妻有苦说不出。水形枝杈很多象树枝一样，此家女人到外地作娼妓。\
"

var xushan_shui = "戌山有水：\
单戌水  土豪家。\
暗通匪类性如麻。\
形破军  囚官衙。\
妻子使坏不救他。\
戌山有水出土豪，家中有钱，出性爆之人，做事官匪勾结，水形不整齐容易坐牢，妻子也怨恨他作坏事，没有能力救他。\
"

var qianshan_shui = "乾山有水：\
乾水长  最为良。\
老父兴家寿而康。\
属宽大  必官郎。\
少子回家近道旁。\
形曲曲  巳现光。\
读书就有声名香。\
<p>\
乾山有水，老父亲能干，身体健康长寿。水形好且多，孩子为当官之人，孩子在外探望家人时路边有许多乡邻绅士来迎接，乾山的水形要是弯弯曲曲的而且清澈明亮，这样的风水会出很有名的读书人。\
六白全是水 不嫌短与长。\
在天如奎照 在地为文昌。\
无论阴阳宅 遇之发其祥。\
形若不斜飞 为官声名香。\
六白指的是后天乾卦，这个位置全是水，不论水的深浅，天上的奎星到地下来就成为文昌星，不论阴宅还是阳宅，有这样的风水都是好风水。水形若不斜着流向它方，指水形要完美，出当官的人，为百姓办事，名声也很好。\
"

var haishan_shui = "亥山有水：\
亥水塘  方团汪。\
天生小儿夜啼郎。\
天皇皇  地皇皇。\
不犯亥水寿命长。\
亥山有水，即使水形很好，也主小儿夜晚长期哭泣。如果这个位置有砂小儿容易夭折。\
"

var gengshan_shui = "庚山有水：\
单庚水  武爵封。\
庚子庚孙在其中。\
形势大  对奇峰。\
师团旅长威名雄。\
庚山有水会出武状元，庚年出生的子孙会应验明显。甲位的山峰形式很大很壮观，肯定出现团长以上的干部，威震远方的英雄。\
"

var youshan_shui = "酉山有水：\
酉水来  一线收。\
江湖花柳快风流。\
形宽大  女多愁。\
愁的夫妻不到头。\
酉山有水，水形象一条直线，很窄很直，直冲过来，这家人风流成性。水形宽大，家中的妇女更是忧愁，有水为桃花，会因此事而离婚。\
兑七宫有水：\
<p>\
七水源源来 必定发横财。\
流神通丙午 挥金土内埋。\
龙神趋乾位 父子上讲台。\
无论阴阳宅 得之均和谐。\
七水指的是后天兑宫，这个宫位有源源不断的水很容易发意外的大财，水要是从兑宫流到南方离宫，花钱很大方也会破大财。水要是从兑方流到乾方，老父亲和儿子都会是有文化之人，会出教书先生，不论阴阳宅兑上有水乾上有水的风水都是好风水。\
"

var xinshan_shui = "辛山有水：\
辛水秀  文人夸。\
澄清形正美女娃。\
方与宽  莫嫌他。\
得元兴隆富贵家。\
辛山有水而且秀美出文人，水形整齐且清澈出美女.不管辛山的水形怎样只要有水就会兴家致富。\
"

var choushan_shui = "丑山有水：\
丑水好 发田庄。\
行为不正作事强。\
形宽大 臭钱囊。\
有事与匪好商量。\
丑山有水，有田有地发财快，唯独行为不正,做事强悍不讲理，水形越大钱越多来路不正，作些官匪勾当之事。\
"
var genshan_shui = "艮方有水：\
艮水高 儿郎多。\
身骑竹马弟与哥。\
文书事 美锦罗。\
男男女女都吟娥。\
艮山有水且水势很大,多生男孩，身骑竹马做游戏，身体也很好，兄弟一起其乐融融，喜欢读书,还会织布，说明心灵手巧，男孩女孩都会吟诗作赋。\
<p>\
艮八宫有水：\
八白水汪汪 上中胎元强。\
田园家快乐 少男名声香。\
长子能致富 中子为仕郎。\
小媳无所为 挟室上高堂。\
通午与流兑 发福均至强。\
流坎并流巽 一点不为良。\
后天八卦艮为八白，艮方水势很大，上、中、下元运都发达兴旺。家中有地种并且阖家欢乐。排行老三的男孩学习好，在当地很出名，老大住在这样的环境里也会发家致富，老二住在这里学习也很好，可以考上仕官。媳妇在家没有什么可以作的，只有在家照顾父母侍奉高堂了。艮宫的水流到南方离宫，或流到西方兑宫。这样会发富更快，要是流到东南巽宫或流到正北坎宫这样就不是好风水了。\
"

var yinshan_shui = "寅山有水：\
单寅水 心巧玲。\
医药中医数大名。\
丝与竹 酬善平。\
泉后隐居乐辛勤。\
寅山有水出心灵手巧之人，也出很有名的医生，琴棋书画，还常常行善作好事。有隐居过清苦快乐生活的倾向。\
"

var bingshan_shui = "丙山有水：\
丙水汪 上中良。\
无论宽大发儿郎。\
太微水 寿星光。\
摧官摧财水中央。\
丙山有水是好风水，不论水的大小都会发排行老二的儿子，这里有水好像和太微星保佑一样，肯定出长寿之人，这里有水还会升官发财。\
"
var wushan_shui = "午山有水：\
午水来 光不开。\
桃花滚滚惹愁怀。\
形不正 心耗财。\
嫖赌逍遥大快哉。\
午山有水不是好的风水，因不正当的男女关系惹事，水形不整齐，每天只想着花钱哄女人开心，吃喝嫖赌不顾正业。\
<p>\
离九宫有水：\
九紫水全通 三阳庆大功。\
流若乾方去 八代诗书坟。\
若是流兑出 江湖花柳中。\
若能流艮出 也主田宅崩。\
正南方离宫有水为九紫，离宫全是水占满丙午丁三山,为荣华富贵之地。南方离宫的水要是流到西北的乾宫，那么就会出吟诗作赋的后代。水要是在正西兑方流走，会出现淫乱之事。水要是经过东南巽位，东方震位，流到艮位汇聚这样也会家破人亡。\
"
var dingshan_shui = "丁山有水：\
丁水流，有良田。\
局大正齐晤牛眠。\
人文盛，笔墨全。\
少为辛勤福寿绵。\
丁山有水，有相当好的田地可以种，说明家庭富裕。水形宽大整齐，象牛可以在那里休息一样的水，这样的风水会出小孩子勤于读书，家中的老人长寿。家中的文房四宝齐全。\
"

var renshan_sha = "壬山有砂：\
壬砂发武贵 秀峰高大位。\
出入佳备有 大名振海内。\
再得丙水照 儿孙以文会。\
壬山有砂出武官，山峰越秀丽高大,武官的级别越高，无论走到哪里名声都很大。如果丙山有水来对应，后代学习也很好。\
"

var zishan_sha = "子山有砂：\
子砂定发富 家有金钱库。\
形若兼破军 兴家是寡妇。\
远近午水照 丑名亦不顾。\
子山有砂可以发家致富，家中很有钱，砂的形状象破军一样不整齐，女人能干，也会出寡妇。午山有水相对应，女人会出现淫乱现象，乡邻说三道四的。\
<p>\
坎一宫有砂：\
一白砂兼有 形要梭子样。\
不问阴阳宅 曲抱在其中。\
立向宜留意 不要逼压宫。\
隔溪并隔水 见之不为凶。\
形如中然断 名为寒透风。\
丁损财亦耗 定主不丰隆。\
若无离水照 孤苦不贫穷。\
一白指的是北方坎宫有砂,形状好像和梭子（中间高两边偏低）一样的山，不论阴阳宅只要北面有这样的山环抱都为好的风水。点穴时要注意不要离北面的山太近了，如太近了叫逼压宫，这样会影响孩子和老三，还有人会短寿。穴位的后面隔水隔溪这样不为凶。如果北面的山中间是断开，这样的风水叫寒透风，丁才两不旺。如果没有正南的水来对照会出孤苦贫穷之人。\
"

var guishan_sha = "癸山有砂：\
癸砂女当家 发在上元花。\
不问男和汉 惧内定数他。\
远近丁水秀 丁财足可夸。\
形若葫芦样 矮郎要怕她。\
癸山有砂，妇女能干并且当家。三元运都可以发家，无论男人多高大魁梧都怕老婆。如果有丁水来对照，这样的风水人财两旺，砂形要是象葫芦，其家的男主人肯定个子不高而且怕老婆。\
"

var weishan_sha = "未山有砂：\
未砂能发财 行为不正来。\
军贼与土匪 名臭通六街。\
形若朝夕秀 丑水照当怀。\
也可置田庄 农家乐和偕。\
未山有砂可以发财，财源不正，官匪勾结臭名远扬。如丑山有像夕阳一样圆水也可以发不义之财，不会出凶事。\
"

var kunshan_sha = "坤山有砂：\
坤砂叠叠起 真是上元花。\
妇女持家政 把酒话桑麻。\
女儿个个俊 发福庆万年。\
若得艮水照 血财发无涯。\
不许形破军 七杈与飞斜。\
坤山有砂，一层一层的，这样的风水是好风水，妇女当家且能干。用酒来庆祝好的收成，女孩子长的也很漂亮，这样的风水发财发富久远。如果得到艮山水的对照，发的财更多但是会出凶事，风水讲究砂水要完美，所以坤位的砂不要砂飞水走。\
<p>\
坤二宫有砂:\
二黑砂完全 金城一照眠。\
上中丁财盛 家富积银钱。\
如得艮水照 福寿又双全。\
局大官清正 内助有名贤。\
二黑指的是西南，坤宫有砂，男女和谐，人财两旺，上元中元更是好的风水。如艮方有水，不但有钱还有福有寿，坤宫的砂高大，当官清正不但妻子很贤惠，而且在当地都很有名气。\
"

var shenshan_sha = "申山有砂：\
申砂女儿美 圆面与长腿。\
形若兼秀起 勤能通义理。\
若与寅水照 丹青画优美。\
申山有砂，女孩漂亮圆脸长腿，如果山形秀美，女孩勤劳且通情达理，如果又得到寅山有水来对照，还会出画家，书法家。\
"

var jiashan_sha = "甲山有砂：\
一马不断甲龙宫 上中时势大吉风。\
若得庚酉波浪起 管教顺利运不穷。\
若在湖中连天涌 定是交鹅影雁中。\
东方全是砂，上元、中元运最好。如果兑宫有水，那是更加顺利，如果水势大，把户主比作天鹅和大雁一起飞一样。象征这样的风水会出现出类拔萃的人物。\
"

var maoshan_sha = "卯山有砂：\
卯砂能致富 血财发无涯。\
长子风四海 性好采野花。\
形若几案拱 威名振三通。\
形如鸡爪样 军贼产其家。\
若照单酉水 多生女娃娃。\
卯山有砂可以致富，但是易出现意外灾难，排行老大的人风流好色，卯砂像茶几一样，老大很有名气。卯山的砂形象鸡爪样（就是砂形不美）也会出现军贼和土匪。如果卯山有砂，酉山再有水来对应多生女孩。\
<p>\
震三宫有砂：\
三碧全体砂 文武共兴家。\
若配乾兑水 上中一鲜花。\
形要贪狼样 人秀分外嘉。\
三碧后天震卦都是砂，不但出文人还出武将，如果乾宫兑宫再有水来对应，上中元运都是非常好的风水，如果山形秀美，好像贪狼一样，人长的都非常漂亮。\
"

var yishan_sha = "乙山有砂：\
乙砂发文章 几个读书郎。\
形势朝笏起 为官名振扬。\
形如笏笔样 翰墨字亦香。\
若遇辛水照 尤主内贤良。\
乙山有砂，家中出读书的人，如果乙山砂的砂形好像和古代大臣上朝时手捧的朝板一样。这样的风水当官可以出大名的。砂的形状象朝笏或象文笔峰这样的风水出文人或书法家。如果辛山有水，会有贤惠的妻子。\
"
var chenshan_sha = "辰山有砂：\
辰砂虽发富 匪人其家住。\
财源不正来 名臭也不顾。\
六亲均无助 相逢似行路。\
形若破碎斜 怕遭非命故。\
辰山有砂虽然可以发富，但家中出土匪或与土匪勾结，财的来路不正当，名声很不好，其亲属和他无来往，在路上遇见了亲人和没看见一样。如果砂形不美，呈现破军的样子，就会出现死于非命的现象。\
"

var xunshan_sha = "巽山有砂：\
巽砂女主家 村邻赞许她。\
形如贪狼样 男女大名鼎。\
若得乾水照 定发上元花。\
巽山有砂，女人当家能干，乡邻都称赞她。砂形象贪狼一样，男女治家有方，在当地很有名气，如果再有乾宫的水来对应肯定会发财。\
<p>\
巽四宫有砂：\
四绿砂完全 正助上中元。\
为人吉幸福 此处卜中眠。\
若得乾午水 父子名声贤。\
为官官亦正 不贪人民钱。\
四绿指的是后天巽卦，此方全是砂，砂形整齐，占满巽宫，这样的风水在上、中元运里突出幸福，这个地方好像风水师给选的。如乾宫有水，离宫有水，父子的名声都很好，当官清正，不会贪污老百姓的钱。\
"
var sishan_sha = "巳山有砂：\
巳砂文书发 中子称美豪。\
形如赤蛇绕 官清似尔曹。\
形若葫芦样 有子有方丈。\
形若尖峰起 财高名声大。\
巳山有砂是出文人的风水排行老二的最出名，砂形好像盘绕的蛇当官清廉，砂形象葫芦，孩子中有出家之人或秃头之人，砂形秀美且高不但很有钱名望也很大。\
"
var xushan_sha = "戌山有砂：\
戌砂号火星 定主回禄惊。\
形若兼破碎 亦怕鼓盆吟。\
形如反门背 为子不投军。\
若遇辰水照 逆水乱胡行。\
戌山有砂应事的速度快，破财，家中不安稳，易发生火灾。砂的形状破碎，主有死妻之凶灾；砂形象反门背当兵死于非命，如果再有辰水来对应，主出无法无天的人。\
"

var qianshan_sha = "乾山有砂：\
乾砂老父伤 小子泪汪汪。\
形若破军样 亦主非命亡。\
形若单胀路 入巽私去娘。\
巽水勺井样 公媳共一床。\
乾山有水伤老父，少男的身体也不好，砂形破碎老父死于非命，砂形象道路一样来到巽方（乾方地势高，巽方地势低），家中女主人会改嫁。巽方有圆形水来对应，这样的风水往往会出现公爹和儿媳都很淫乱。\
<p>\
乾六宫有砂：\
六白一体砂 上中时败家。\
老父心无主 行事乱如麻。\
再遇辰巽巳 杏仁野桃花。\
子媳长少绝 定是砂飞斜。\
六白指的是后天乾卦上元运当中败家明显。老父没有主见，做事没有条理，会有精神病症，如巽方有水肯定出现风流淫乱的行为，若砂形斜飞，孩子媳妇都会出现短命的现象。\
"

var haishan_sha = "亥山有砂：\
亥砂天皇皇 家生夜啼郎。\
形若十丈起 发富不久长。\
巳水方形照 僧人入香房。\
夫君配秃郎 丑名不可扬。\
亥山有砂，小孩夜间常哭而且会夭折，亥砂高大有十丈高，虽然发富也不会长久。如巳方再有水呈方形，女人和秃头或和尚通奸，丈夫要是秃子就没有这样的事，如丈夫不是秃子或秃顶（头发很少）女人肯定有通奸之事，臭名远扬。\
"

var gengshan_sha = "庚山有砂：\
庚砂惹祸端 煞到主见官。\
甲水对宫照 长子绝嗣完。\
形若飞刃下 是非闹不安。\
庚山有砂，很容易出现口舌是非，很容易打官司。若甲山再有水，长子会绝后。庚山的砂形好像一把刀一样，家中不会安宁，是非不断。\
"

var youshan_sha = "酉山有砂：\
酉砂直硬来 丑名怀私胎。\
哑儿因此出 毒入口难开。\
长子多绝嗣 绝朝有愁怀。\
卯水再对照 定是要破财。\
酉山有砂直冲过来，会出现怀有他人的私胎，孩子因自卑而少说话，有人骂他他也不还口，长子没有儿子，或克子，家中长期有说不出的忧愁。卯山要是有水，家中肯定有破大财之事。\
<p>\
兑七宫有砂：\
七赤砂满现 子宫难名见。\
长舌妇女有 男女把天怨。\
官非时不断 心田不良善。\
再照辰巽水 奸猾百诈变。\
七赤指的是后天兑卦，此方全是砂，此户人家不易有儿子，家中妇女时常说东道西，男女怨声载道，怨天怨地，官司口舌是非常年不断。这样的风水生下的孩子心术不正，不善良，巽宫再有水，更狡猾奸诈善辩。\
"

var xinshan_sha = "辛山有砂：\
辛砂主肺痨 医药病难调。\
形若尖刀下 肝病焉能逃。\
再遇乙水照 小口似风摇。\
辛山有砂会出现肺病，很难治好，砂形象尖刀还会出现肝病现象。乙山再有水，小孩子的身体也不会健康，大风都可以把她刮倒，说明小孩的身体很弱。\
"

var choushan_sha = "丑山有砂：\
丑砂为贼盗 名被他人告。\
形若拖刀样 屠夫手快妙。\
少男人丁绝 家财人争闹。\
丑山有砂出盗贼，当官也是贪官，很容易被人家揭发。砂形象拖刀的样子，出手法很快的屠夫，排行老三的会无子，常常因为家产或财务争吵。\
"
var genshan_sha = "艮山有砂：\
艮砂没儿郎 胎元受其伤。\
小口难抚养 尤主家不祥。\
形若七桠叉 先绝是小房。\
坤水对面照 腹病妇女亡。\
艮山有砂容易坠胎，很难生儿子，儿子常年有病，家中常年有不详的事发生。砂形好像树杈一样，老三肯定没有儿子。如果坤宫再有水，女人会出先腹水难产等症状，还会短寿。\
<p>\
艮八宫有砂：\
八白砂完全 凶现在三元。\
形为都不正 是非多缠绵。\
穷郎与乞丐 到处惹人嫌。\
未坤水对照 夫妻不团圆。\
后天艮卦三山全是砂，在每个元运种都很凶，此家的人行为都不正，惹事生非，贫穷，以讨要为生，到处招人嫌。坤卦再有水对照，夫妻不到白头。\
"

var yinshan_sha = "寅山有砂：\
寅砂出僧道 或出医师妙。\
形如三角样 犬狼偏遇到。\
六指或产出 学道有心窍。\
寅山有砂会出僧人老道或出医生，砂形象三角的形状，家中会出现被动物咬伤的事情，这样的风水会出六指之人。这个人很聪明心灵手巧。\
"

var bingshan_sha = "丙山有砂：\
丙砂太不强 中子目定盲。\
形若高尖起 亦主吐血亡。\
壬水再对照 先绝是二房。\
丙山有砂不会太富强，中男中女会出现失明或近视的现象，砂形尖而且很高会出先吐血而亡的现象，壬山再有水，老二没后代，或先生女后生男。\
"

var wushan_sha = "午山有砂：\
午砂出穷郎 亦主非命亡。\
形若三角起 双目一起伤。\
心痛为小事 野郎伴似娘。\
子水再相见 吐血面皮黄。\
午山有砂老二贫穷，容易死于非命，如砂形为三角形，有双目失明的危险，还会出现心脏病，中男找比他年纪大的人女人作为情人，子山再有水，面黄肌瘦还会有吐血的现象。\
<p>\
离九宫有砂：\
九紫全体砂 上元是败家。\
绝二又绝长 四九配交叉。\
五官形不正 难比施公斜。\
壬子癸水照 断定是绝家。\
无论阴阳宅 切忌犯离砂。\
离灶与离路 都宜改换它。\
九紫指的是后天离卦全是砂。此种风水上元运最凶，中男和长男没有儿子，四（指的是巽宫）有水，九（指的是离宫）有砂，这样环境生下的小孩五官不正，长的很丑陋。坎宫有水来对应，这家人肯定没有后代，指没有男孩。南方有灶台或有路直冲，都要改换自己的位置。\
"

var dingshan_sha = "丁山有砂：\
丁砂病不祥 药炉不离房。\
形若一条枪 尤伯非命伤。\
形苦探扒样 军贼枪下亡。\
癸水登清蓄 定有寡妇娘。\
丁山有砂，常年有病，药品常年在身边。砂形象枪一样，很容易死于非命；砂形象探扒样，和人家打架时被打死或死在枪口之下。如癸山有一洼清水，此户人家会出寡妇。\
"