var shigan_keying = new Array(100)

shigan_keying['乙甲'] = '乙加甲为“奇入天门”，万事皆旺，三门会合吉，门逢凶迫，不利。'

shigan_keying['乙乙'] = '乙加乙为“日奇伏吟”：不宜谒贵求名，只可安分守身。'

shigan_keying['乙丙'] = '乙加丙为“奇仪顺遂”：吉星为迁官进职；凶星为夫妻别离。'

shigan_keying['乙丁'] = '乙加丁为“奇仪相佐”：文书事吉，百事可为。'

shigan_keying['乙戊'] = '乙加戊为“利阴害阳”：门逢凶迫，财破人伤。'

shigan_keying['乙己'] = '乙加己为“日奇入雾”：被土暗昧，门凶必凶；得开门为地遁。'

shigan_keying['乙庚'] = '乙加庚为“日奇被刑”：争讼败产，夫妻怀私。'

shigan_keying['乙辛'] = '乙加辛为“青龙逃走”：奴仆拐带，六畜皆伤。'

shigan_keying['乙壬'] = '乙加壬为“日奇入地”：尊卑悖乱，官讼是非。'

shigan_keying['乙癸'] = '乙加癸为“华盖青龙”：遁迹修道，隐匿藏形，避灾避难为吉。又名“华盖逢星官”。'

shigan_keying['丙乙'] = '丙加乙为“日月并行”：公谋私为皆吉。'

shigan_keying['丙丙'] = '丙加丙为“月奇孛师”：文书逼迫，破耗遗失。'

shigan_keying['丙丁'] = '丙加丁为“月奇朱雀”：贵人文书吉利，常人平静。得生门为天遁。'

shigan_keying['丙戊'] = '丙加戊为“飞鸟跌穴”：谋为百事，吉顺洞彻。'

shigan_keying['丙己'] = '丙加己为“火孛入刑”：囚人刑杖，文书不行。吉门得吉，凶门转凶。'

shigan_keying['丙庚'] = '丙加庚为“荧入太白”：门户破败，盗贼耗失。'

shigan_keying['丙辛'] = '丙加辛为“奇神相合”：谋事成就，病人不凶。'

shigan_keying['丙壬'] = '丙加壬为“火入天罗”：为客不利，是非颇多。'

shigan_keying['丙癸'] = '丙加癸为“华盖悖师”：阴人害事，灾祸频生。'

shigan_keying['丁乙'] = '丁加乙为“人遁吉格”：贵人加官进爵，常人婚姻财喜。'

shigan_keying['丁丙'] = '丁加丙为“星随月转”：贵人越级高升；常人乐中生悲。'

shigan_keying['丁丁'] = '丁加丁为“奇入太阴”：文书即至，喜事遂心。'

shigan_keying['丁戊'] = '丁加戊为“青龙转光”：贵人升迁，常人咸昌。'

shigan_keying['丁己'] = '丁加己为“火入勾陈”：奸私仇冤，事因女人。'

shigan_keying['丁庚'] = '丁加庚为“年月日时格”，文书阻隔，行人必归。'

shigan_keying['丁辛'] = '丁加辛为“朱雀入狱”：罪人释囚，官人失位。'

shigan_keying['丁壬'] = '丁加壬为“五神互合”：贵人恩诏，讼狱公平。'

shigan_keying['丁癸'] = '丁加癸为“朱雀投江”：文书口舌俱消，音信沉溺。'

shigan_keying['戊乙'] = '戊加乙为“青龙合灵”：门吉事吉，门凶事凶。'

shigan_keying['戊丙'] = '戊加丙为“青龙反首”：动作大吉，迫墓击刑，吉事成凶。'

shigan_keying['戊丁'] = '戊加丁为“青龙耀明”：谒贵求名吉利；若值墓迫，惹是招非。'

shigan_keying['戊戊'] = '戊加戊为“伏吟”：凡事闭塞阻滞，静守为吉。'

shigan_keying['戊己'] = '戊加己为“贵人入狱”：公私皆不利。'

shigan_keying['戊庚'] = '戊加庚为“值符飞宫”：吉事不吉，凶事更凶。'

shigan_keying['戊辛'] = '戊加辛为“青龙折足”：吉门生助，尚可谋为，若逢凶门，拐带失财，兼有足疾。'

shigan_keying['戊壬'] = '戊加壬为“龙入天牢”：凡阴阳皆不吉利。'

shigan_keying['戊癸'] = '戊加癸为“青龙华盖”：门吉招福，门凶多乖。'

shigan_keying['己乙'] = '己加乙为“墓神不明”：地户蓬星，宜遁迹隐形为利。'

shigan_keying['己丙'] = '己加丙为“火悖地户”：阳人冤冤相害，阴人必致淫污。'

shigan_keying['己丁'] = '己加丁为“朱雀入墓”：文状词讼，先曲后直。'

shigan_keying['己戊'] = '己加戊为“犬遇青龙”：门吉谋望遂意，上人见喜；门凶枉劳心机。'

shigan_keying['己己'] = '己加己为“地户逢鬼”：病者必死，百事不遂。'

shigan_keying['己庚'] = '己加庚为“刑格反名”：词讼先动者不利，阴星有谋害之情。'

shigan_keying['己辛'] = '己加辛为“游魂入墓”：大人鬼魅，小人家先为祟，凶。'

shigan_keying['己壬'] = '己加壬为“地网高张”：狡童佚女，奸情伤杀。'

shigan_keying['己癸'] = '己加癸为“地刑玄武”：男女疾病垂危，词讼有囚狱之灾。'

shigan_keying['庚乙'] = '庚加乙为“太白蓬星”：退吉进凶。'

shigan_keying['庚丙'] = '庚加丙为“太白入荧”：占贼必来，为客进利，为主破财。'

shigan_keying['庚丁'] = '庚加丁为“亭亭之格”：因私暱起官司，门吉有救。'

shigan_keying['庚戊'] = '庚加戊为“太白天乙伏宫”：百事不可谋为，凶。'

shigan_keying['庚己'] = '庚加己为“刑格”：官司被重刑，诸事有阻遏。'

shigan_keying['庚庚'] = '庚加庚为“太白同宫”：官灾横祸，兄弟雷攻。又名“战格”。'

shigan_keying['庚辛'] = '庚加辛为“白虎干格”：远行必凶，车折马死。'

shigan_keying['庚壬'] = '庚加壬为“上格”：远行失迷道路，男女音信嗟呀。'

shigan_keying['庚癸'] = '庚加癸为“大格”：行人至，官司止，生产母子俱伤，大凶。'

shigan_keying['辛乙'] = '辛加乙为“白虎猖狂”：人亡家败，远行多殃，尊长不喜，车船俱伤。'

shigan_keying['辛丙'] = '辛加丙为“干合悖师”：荧惑出现，占雨无，占晴旱，占事必因财致讼。'

shigan_keying['辛丁'] = '辛加丁为“狱神得奇”：经商获倍利，囚人逢赦宥。'

shigan_keying['辛戊'] = '辛加戊为“困龙被伤”：官司破财，屈抑守分吉，越分妄动祸殃。'

shigan_keying['辛己'] = '辛加己为“入狱自刑”：奴仆背主，讼诉难伸。'

shigan_keying['辛庚'] = '辛加庚为“白虎出力”：刀刃相接，主客相残。逊让退步稍可，强进血溅衣衫。'

shigan_keying['辛辛'] = '辛加辛为“伏吟天庭”：公废私就，讼狱自罹罪名。'

shigan_keying['辛壬'] = '辛加壬为“凶蛇入狱”：两男争女，讼狱不息，先动失理。'

shigan_keying['辛癸'] = '辛加癸为“天牢华盖”：日月失明，误入天网，动止乖张。'

shigan_keying['壬乙'] = '壬加乙为“小蛇日奇”：女子柔顺，男人嗟叹。占孕生子，禄马光华。'

shigan_keying['壬丙'] = '壬加丙为“水蛇入火”：官灾刑禁，络绎不绝。'

shigan_keying['壬丁'] = '壬加丁为“干合蛇刑”：文书牵连，贵人匆匆，女吉男凶。'

shigan_keying['壬戊'] = '壬加戊为“小蛇化龙”：男人发达，女产婴童。'

shigan_keying['壬己'] = '壬加己为“干合蛇刑”：大祸将至，顺守斯吉，词讼理屈。'

shigan_keying['壬庚'] = '壬加庚为“太白擒蛇”：刑狱公平，立剖邪正。'

shigan_keying['壬辛'] = '壬加辛为“螣蛇相缠”：纵得奇门，亦不能安。若有谋望，被人欺瞒。'

shigan_keying['壬壬'] = '壬加壬为“蛇入地罗”：外人缠绕，内事索索，吉门吉星，庶免磋砣。'

shigan_keying['壬癸'] = '壬加癸为“幼女奸淫”：家有丑声，门星俱吉，反祸福隆。'

shigan_keying['癸乙'] = '癸加乙为“华盖蓬星”：贵人禄位，常人平安。'

shigan_keying['癸丙'] = '癸加丙为“华盖孛师”：贵贱逢之，上人见喜。'

shigan_keying['癸丁'] = '癸加丁为“螣蛇夭矫”：文书官司，火焚莫逃。'

shigan_keying['癸戊'] = '癸加戊为“天乙会合”：吉格，财喜婚姻，吉人赞助成合。若门凶迫制，反祸官非。'

shigan_keying['癸己'] = '癸加己为“华盖地户”：男女占之，音信皆阻，躲灾避难为吉。'

shigan_keying['癸庚'] = '癸加庚为“太白入网”：以暴争讼力平。'

shigan_keying['癸辛'] = '癸加辛为“网盖天牢”：占病占讼，死罪莫逃。'

shigan_keying['癸壬'] = '癸加壬为“复见螣蛇”：嫁娶重婚，后嫁无子，不保年华。'

shigan_keying['癸癸'] = '癸加癸为“天网四张”：行人失伴，病讼皆伤。'

shigan_keying['甲己'] = '甲加己为“贵人入狱”，凡占公私皆不利，又为青龙相合。'

var biangan = new Array(100)

biangan['乙甲'] = '遍干诀曰：“乙加甲为奇入天门，万事皆旺，三门会合吉，门逢凶迫，不利。正格：退茹格。诀曰：“辛庚己戊退茹是，休咎皆宜步回旋” 。'

biangan['乙乙'] = '遍干诀曰：“乙奇逢是加乙奇，两日同出地天离。如非敌国来侵占，定是中土起军师”。乙加乙，为两日同出格，奇中伏奇，日奇伏吟。不宜谒贵求名，宜安守身吉。转盘时干克应：乙加乙为“日奇伏吟”：不宜谒贵求名，只可安分守身。正格：交阳格，诀曰：“丁加戊上交阳是 ，脱我精神我有伤”。'

biangan['乙丙'] = '遍干诀曰：“乙奇合来丙日分，合明日月是共嵇。凡事虽然至顺遂，前进未免有参差”。乙加丙，为日月合明格，奇蔽明堂，奇仪顺遂。先明后暗。门宫相生，诸事显扬，吉星晋职，凶星别离。转盘时干克应：乙加丙为“奇仪顺遂”：吉星为迁官进职；凶星为夫妻别离。正格：'

biangan['乙丁'] = '遍干诀曰：“日映太阴乙丁合，运中总进意婆婆。诸谋虽然君子助，亦难免去小消磨”。乙加丁为日映太阴格，奇助玉女，奇仪相佐 ，有进得速之妙，阴人扶助之情。文书事吉，百事可为。转盘时干克应：乙加丁为“奇仪相佐”：文书事吉，百事可为。正格：前间格。诀曰：“乙丁壬甲前间格，进步中途有阻拦”。又为夺权格。诀曰：“夺权如乙加丁位 ，我之权衡被人夺” 。'

biangan['乙戊'] = '遍干诀曰：“日奇升在天门坐，乙木加之戊土窝。近尊辅贵多获吉，受制他人事始和。天乙加地戊，为日升天门格，利见大人之局，依尊附贵之情。若星迫制，利阴害阳；门逢凶迫，财被人伤。转盘时干克应：乙加戊为“利阴害阳”：门逢凶迫，财破人伤。正格：外害格。诀曰：“六乙加戊为外害，灾殃陡起在他乡”。'

biangan['乙己'] = '遍干诀曰：“日入地户为丧明，天乙加临地己行。事主先明而后暗，两人并力相争衡”。乙加己为日入地户格，日奇入露，被土暗昧，门凶事凶，门吉事吉，得三吉门为地遁。转盘时干克应：乙加己为“日奇入雾”：被土暗昧，门凶必凶；得开门为地遁。正格：外乱格。诀曰：“乙加己位为外乱，外国来兵要侵疆”。'

biangan['乙庚'] = '遍干诀曰：“云覆太白乙庚映，以柔制刚事乃成。内里偏宜妇人集，婚姻和合怀称情”。乙加庚为云覆太白格，日奇被刑，争讼财产，夫妻怀私。奇入太白为用柔刚之义，婚姻和合之情。转盘时干克应：乙加庚为“日奇被刑”：争讼败产，夫妻怀私。正格：上合格。诀曰：“上合乙庚甲与己，上亲于下下人欢”，又为合金格，诀曰：“合金钱财宜兵权”。又为内侵格。诀曰：“庚上加乙内侵格 ，家中欺我意不良”。'

biangan['乙辛'] = '遍干诀曰：“青龙逃走乙加辛，宫使相生雨露臻。占课逃亡人口事，失却 钱财门里邻”。乙加辛为青龙逃走格，奴仆拐逃，六畜皆伤，破财损失。转盘时干克应：乙加辛为“青龙逃走”：奴仆拐带，六畜皆伤。正格：内乱格，诀曰：“己加乙字内人乱，家里纷纷 无主张”。又为正冲格，诀曰：“正冲庚上忽加甲 ，对面交锋无拘牵”。又为木冲格，诀曰：“木冲须宜用义宣”。'

biangan['乙壬'] = '遍干诀曰：“玄神捧日格祯祥，乙木临之壬水旁。最好招安举大事，家庭和顺姓名扬”。乙加壬为元武捧日格，门凶迫制，为日奇入地，尊卑悖乱，是非，奇神入狱，彼此宜固守。转盘时干克应：乙加壬为“日奇入地”：尊卑悖乱，官讼是非。正格：获父格，诀曰：“己加六丙谓获父 ，福德贵人在身旁”。'

biangan['乙癸'] = '遍干诀曰：“乙日加临癸水乡，蛇神拱日利门疆。占之教化为祥瑞，创业行为百事昌”。乙加癸为蛇神拱日格，奇逢罗网，华盖蓬星。遁迹修道，隐匿藏形，宜躲灾避难为吉。转盘时干克应：乙加癸为“华盖青龙”：遁迹修道，隐匿藏形，避灾避难为吉。又名“华盖逢星官”。正格：倚势格，诀曰：“丁加于乙是倚势 ，赖侍他人我得扬”。'

biangan['丙乙'] = '遍干诀曰：“月明云白多康乐，天丙加在乙木上。文章赫变添喜色，龙凤呈祥好时光”。丙加乙为月明云白格，月照沧海，日月并行，公私皆吉。转盘时干克应：丙加乙为“日月并行”：公谋私为皆吉。正格：得母格，诀曰：“庚加六己为得母，家中喜悦 庆嘉祥”。'

biangan['丙丙'] = '遍干诀曰：“荧惑重重须稳步，丙奇加临丙奇乡。势力辉煌宜举火，官灾口舌霎时昌”。丙加丙为荧惑重现格，月奇孛师，文书逼迫，破耗遗失。门星生合，二凤 和鸣，有势辉煌，以文会友。转盘时干克应：丙加丙为“月奇孛师”：文书逼迫，破耗遗失。正格：'

biangan['丙丁'] = '遍干诀曰：“月光星灿格宜美，丙月丁星处一方。贵人生合功名遇，进步谋为事事康”。丙加丁为日光星灿格，星月光辉，朱雀贵人，文书吉利。常人平静，得三吉门为天遁。转盘时干克应：丙加丁为“月奇朱雀”：贵人文书吉利，常人平静。得生门为天遁。正格：进茹格，诀曰：“戊己庚辛壬下癸 ，进茹臧否喜来前”。'

biangan['丙戊'] = '遍干诀曰：“飞鸟跌穴丙戊旁，上书献策亦嘉祥。求名谒贵无不利，学道修身最为良”。丙加戊为飞鸟跌穴格，凡所谋求，百事洞彻，无不吉利。转盘时干克应：丙加戊为“飞鸟跌穴”：谋为百事，吉顺洞彻。正格：耗气格，诀曰：“耗气丙奇加六戊，我之财物不保全”。前间格，诀曰：“乙丁壬甲前间格，进步中途有阻拦”。'

biangan['丙己'] = '遍干诀曰：“荧惑入户丙交己，兴师我自犯惊虚。主军不吉客军吉，怨结恩消祸有余”。丙加己为荧惑入户格，奇入明堂，火孛入刑，囚人刑杖，文书不行，吉门得吉，凶门转凶。转盘时干克应：丙加己为“火孛入刑”：囚人刑杖，文书不行。吉门得吉，凶门转凶。正格：交阴格，诀曰：“丙加于己交阴象，隐匿阴私利伏藏”。'

biangan['丙庚'] = '遍干诀曰：“丙火来临庚字上，出军兵交任卷舒。安良戳暴尤其善，买卖经营意不遂”。丙加庚为荧 入太白格，门户破败，盗贼耗失，若门宫吉，可以谋动。转盘时干克应：丙加庚为“荧入太白”：门户破败，盗贼耗失。正格：外制格，诀曰：“丙奇加庚为外制 ，他人欺辖隐钩铓”。'

biangan['丙辛'] = '遍干诀曰：“荧入合神丙见辛，病人沉重状词伸。两恩互感成相济，同治情交气象新”。丙加辛为荧惑遇合格，奇神生合，谋事成就，合财 得位，病人不凶。转盘时干克应：丙加辛为“奇神相合”：谋事成就，病人不凶。正格：上合格，诀曰：“上合乙庚甲与己，上亲于下下人欢”。又为合水格，诀曰：“合水漂泊宜淫私”。又为外侵格，诀曰：“乙上加庚外侵局，外人欺我要提防”。'

biangan['丙壬'] = '遍干诀曰：“丙奇若遇壬仪会，月覆天牢祸患频。妇人招惹风情事，口舌官非婉转轮”。丙加壬为月覆天牢格，奇神游海，火入天罗。为客不利，是非频多，诸事虽吉，但防不实。转盘时干克应：丙加壬为“火入天罗”：为客不利，是非颇多。正格：内制格，诀曰：“庚上加乙内侵格 ，家中欺我意不良”。又为正冲格，诀曰：“正冲庚上忽加甲 ，对面交锋无拘牵”。又为火冲格，诀曰：“火冲用文及用火”。'

biangan['丙癸'] = '遍干诀曰：“鸟入罗网丙加癸，跌来祸事更相因。潜居隐士为良策，何必营营苦染尘”。丙加癸为飞鸟入网格，奇逢华盖，华盖孛师，阴人害事，灾祸频生。转盘时干克应：丙加癸为“华盖悖师”：阴人害事，灾祸频生。正格：内害格，诀曰：“内害丙奇加在癸，是非口舌家内猖 ”。'

biangan['丁乙'] = '遍干诀曰：“玉女乘云丁遇乙，谋为吉利又相宜。贵人迁职且高升，官事消亡事事随。天丁加地乙，为玉女乘云格，又人遁吉格，贵人加官进爵，常人婚姻财喜，诸事大吉。转盘时干克应：丁加乙为“人遁吉格”：贵人加官进爵，常人婚姻财喜。正格：倚势格，诀曰：“丁加于乙是倚势 ，赖侍他人我得扬”。又为后间格，诀曰：“后间丁乙甲壬类，退后当中犯艰难”。'

biangan['丁丙'] = '遍干诀曰：“玉女忽来逰月下，丙奇遇着见丁奇。缓缓施为多吉庆，贵人扶恩受诏熙”。丁加丙为玉女逰月格，奇神合明，星遂月转，贵人越级高升，常人乐里生悲。转盘时干克应：丁加丙为“星随月转”：贵人越级高升；常人乐中生悲。正格：退茹格，诀曰：“辛庚己戊退茹是，休咎皆宜步回旋”。'

biangan['丁丁'] = '遍干诀曰：“天丁逢是加地丁，朱雀叠来见火星。君子知机先举动，如然遇劫保安宁”。丁加丁为朱雀叠来格，奇神相敌，奇入太阴，文书即至，诸事虽吉，恐有相争，喜事遂心，先动为利。转盘时干克应：丁加丁为“奇入太阴”：文书即至，喜事遂心。伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['丁戊'] = '遍干诀曰：“玉女乘龙须待聘，丁奇俄在甲公所。贵人迁职加级禄，立志清高姓勒铭”。丁加戊为玉女乘龙格，又青龙转光格，贵人升迁，常人威昌，诸事遂意，万事咸吉。转盘时干克应：丁加戊为“青龙转光”：贵人升迁，常人咸昌。正格：交阳格，诀曰：“丁加戊上交阳是 ，脱我精神我有伤”。'

biangan['丁己'] = '遍干诀曰：“天丁加在己干旁，玉女私奔自向前。启户留郎非风缘，官司口舌如麻缠”。丁加己为玉女启户格，又玉女施恩，火入勾陈，奸私仇怨，事因女人。转盘时干克应：丁加己为“火入勾陈”：奸私仇冤，事因女人。正格：前间格。诀曰：“乙丁壬甲前间格，进步中途有阻拦”。又为夺权格。诀曰：“夺权如乙加丁位 ，我之权衡被人夺”。'

biangan['丁庚'] = '遍干诀曰：“丁奇或与庚仪见，玉女持锋慎过愆。凡事难谋不称意，是非颠倒祸牵连”。丁加庚为玉女持锋格，又玉女制煞，凡事难以强图，年月日时格，文书阻隔，行人必归。转盘时干克应：丁加庚为“年月日时格”，文书阻隔，行人必归。正格：外害格。诀曰：“六乙加戊为外害，灾殃陡起在他乡”。'

biangan['丁辛'] = '遍干诀曰：“六丁若或加六辛，玉女骑之猛虎身。求谋不利防刑狱，谋事艰难又损人”。丁加辛为玉女骑虎格，又玉女伏虎，朱雀入狱，罪人释囚，贵人不利，求谋不遂。转盘时干克应：丁加辛为“朱雀入狱”：罪人释囚，官人失位。正格：外乱格。诀曰：“乙加己位为外乱，外国来兵要侵疆”。'

biangan['丁壬'] = '遍干诀曰：“勾和玉女丁壬撞，凡事皆遂无等双。贵人相遇升迁喜，美乐私衷弄好情”。丁加壬为玉女勾和格，又玉女乘龙，万事得吉，百福来迎，贵人和合，五神互合，贵人恩诏，讼狱公平。转盘时干克应：丁加壬为“五神互合”：贵人恩诏，讼狱公平。正格：上合格，诀曰：“上合乙庚甲与己，上亲于下下人欢”。又为合木格，诀曰：“合木发生宜市廛”。'

biangan['丁癸'] = '遍干诀曰：“丁见癸字雀投江，文书遗失寻明。彼此惊疑心未定，敌军胜我不归降”。丁加癸为朱雀投江格，文书口舌俱消，音信沉溺。转盘时干克应：丁加癸为“朱雀投江”：文书口舌俱消，音信沉溺。正格：内乱格，诀曰：“己加乙字内人乱，家里纷纷 无主张”。又为正冲格，诀曰：“正冲庚上忽加甲 ，对面交锋无拘牵”。又为火冲格，诀曰：“火冲用文及用火”。'

biangan['戊乙'] = '遍干诀曰：“青龙入云戊加乙，同人扶助事得全。若或门宫逢迫制，定然彼我自招愆”。 天盘戊加地盘乙，为青龙入云格。门吉事吉，门凶事凶。转盘时干克应：戊加乙为“青龙合灵”：门吉事吉，门凶事凶。正格：内害格，诀曰：“内害丙奇加在癸，是非口舌家内猖 ”。'

biangan['戊丙'] = '遍干诀曰：“戊加丙字 龙返首，门宫生合事更新。文明显达多得利，彼迫旬空亦忧接”。天盘戊加地盘丙，为青龙返首。动作大利。若逢迫制入墓击刑，吉事反凶。转盘时干克应：戊加丙为“青龙反首”：动作大吉，迫墓击刑，吉事成凶。正格：乘权格，诀曰：“庚加戊字 秉权格 ，假势兴隆大吉昌”。'

biangan['戊丁'] = '遍干诀曰：“青龙耀明戊加丁，贵人暗动但安祥。门宫相生为上吉，被迫交加事转难”。此格主谒贵求名吉利，若迫墓招是非。转盘时干克应：戊加丁为“青龙耀明”：谒贵求名吉利；若值墓迫，惹是招非。正格：得母格，诀曰：“庚加六己为得母，家中喜悦庆嘉祥”。'

biangan['戊戊'] = '遍干诀曰：“天盘戊加地盘戊，青龙入地伏吟盘。 翻来辗转神未定，心意徘徊起波澜”。天戊加地戊，青龙入地格，又天门重现格。凡事闭塞，静守为吉。转盘时干克应：戊加戊为“伏吟”：凡事闭塞阻滞，静守为吉。伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['戊己'] = '遍干诀曰：“青龙比合戊加己，婚姻成就喜气盈。内外生扶室家利，克战临来反震惊”。天戊加地戊，为青龙比和格，主婚姻之喜，公私吉利。迫墓克制及凶门，名贵人入狱，公私不利。转盘时干克应：戊加己为“贵人入狱”：公私皆不利。正格：进茹格，诀曰：“戊己庚辛壬下癸 ，进茹臧否喜来前”。'

biangan['戊庚'] = '遍干诀曰：“青龙失利戊加庚，谋事纷争难立名。逢之伤损休依恋，点点血光利操兵”。天戊加地庚，为青龙失利 格，又青龙恃势、值符飞宫，灾祸出于不测，吉事不吉，凶事更凶。转盘时干克应：戊加庚为“值符飞宫”：吉事不吉，凶事更凶。正格：前间格。诀曰：“乙丁壬甲前间格，进步中途有阻拦”。又为耗气格，诀曰：“耗气丙奇加六戊，我之财物不保全”。'

biangan['戊辛'] = '遍干诀曰：“戊与辛金同一处，青龙相侵是返吟。占之遇此当自守，动作必然是祸淫”。天戊加地辛，谓之青龙相侵格，又名青龙折足。吉门生助尚可谋为，若凶门迫制，主招带 失财，足疾。转盘时干克应：戊加辛为“青龙折足”：吉门生助，尚可谋为，若逢凶门，拐带失财，兼有足疾。正格：交阴格，诀曰：“丙加于己交阴象，隐匿阴私利伏藏”。又为支破格，诀曰：“支破即如庚加癸 ，谋为不就事虚然”。'

biangan['戊壬'] = '遍干诀曰：“龙入天牢戊加壬，诸谋耗散凶灾临。口舌纷纭烟酋起 ，始终不离祸害深”。天戊加地壬，为龙入天牢格，又名青龙入网格。凡阴阳皆不吉利，诸事耗散。转盘时干克应：戊加壬为“龙入天牢”：凡阴阳皆不吉利。正格：正格：外制格，诀曰：“丙奇加庚为外制 ，他人欺辖隐钩铓”。'

biangan['戊癸'] = '遍干诀曰：“戊若加癸青龙合，首尾相应庆三多。明显光辉宜主客，门宫迫制反奔波”。天戊加地癸为青龙合和格，又为青龙华盖格，门合星吉则吉招福。临伤死门凶，不美多乖。转盘时干克应：戊加癸为“青龙华盖”：门吉招福，门凶多乖。正格：上合格，诀曰：“上合乙庚甲与己，上亲于下下人欢”。又为合火格，诀曰：“合火文书与音信，功名筹策宜聘贤”。'

biangan['己乙'] = '遍干诀曰：“己仪如然加在乙，地中掩日事蹉跎。安常守分寻器路，动作灾殃似电过。天己加地乙，为地中掩日格，墓神不明，地户蓬星。凡事暗昧不明，主于蒙蔽侵犯，宜遁迹隐形为利逸。转盘时干克应：己加乙为“墓神不明”：地户蓬星，宜遁迹隐形为利。正格：内乱格，诀曰：“己加乙字内人乱，家里纷纷 无主张”。'

biangan['己丙'] = '遍干诀曰：“地户埋光己加丙，外不明子内生明。别有洞天真乐境，创业兴工与凋零”。己加地丙为地户埋光格，又火孛地户。恩中成怨，凡事阻屈难申。转盘时干克应：己加丙为“火悖地户”：阳人冤冤相害，阴人必致淫污。正格：获父格，诀曰：“己加六丙谓获父 ，福德贵人在身旁”。'

biangan['己丁'] = '遍干诀曰：“地户星辉己加丁，求谋诸事并经营。暗中就有贵人助，入庙最宜祷神灵”。天己加地丁，为地户星辉格，又朱雀入墓格。词讼先曲后直，明堂贪生，诸事暗中生扶。转盘时干克应：己加丁为“朱雀入墓”：文状词讼，先曲后直。正格：后间格，诀曰：“后间丁乙甲壬类，退后当中犯艰难”。'

biangan['己戊'] = '遍干诀曰：“比和一气己加戊，明事不宜暗事宜。占之男女约相会，暗地私情起阴合”。 己加戊为比合暗通格，又明堂从禄格，万事大吉，喜乐重逢。犬遇青龙，谋望遂意，上人见喜。转盘时干克应：己加戊为“犬遇青龙”：门吉谋望遂意，上人见喜；门凶枉劳心机。正格：退茹格，诀曰：“辛庚己戊退茹是，休咎皆宜步回旋”。'

biangan['己己'] = '遍干诀曰：“天己若然加地己，地户伏吟事堪怨。进退难明意不决，守分奈常须待时”。己加己为伏吟逢鬼格，病者必死，百事不遂。明堂重逢，凡事屈曲难明，进退不决，宜守。转盘时干克应：己加己为“地户逢鬼”：病者必死，百事不遂。正格：伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['己庚'] = '遍干诀曰：“若天己干加在庚，地户伏白驳杂生。诸事似益终不益，占之不可不查情”。己加庚为地户伏白格，又明堂生煞，刑格反名。词讼先动不利，门凶有阴私谋害之情。转盘时干克应：己加庚为“刑格反名”：词讼先动者不利，阴星有谋害之情。正格：交阳格，诀曰：“丁加戊上交阳是 ，脱我精神我有伤”。'

biangan['己辛'] = '遍干诀曰：“己如加在辛金上，虎困穴中起斗争。伤财惹气终难免，乘武谋为小有恒”。己加辛，谓之虎困穴中格，又天庭得势格，游魂入墓，大人鬼魅相侵，小人家先为祟 。转盘时干克应：己加辛为“游魂入墓”：大人鬼魅，小人家先为祟，凶。正格：夺权格。诀曰：“夺权如乙加丁位 ，我之权衡被人夺” 。又为前间格，诀曰：“乙丁壬甲前间格，进步中途有阻拦”。'

biangan['己壬'] = '遍干诀曰：“地牢冲破己加壬，诸事无成有小侵。格中参差谋多变，门宫生命便称心”。 己加壬为地牢冲破格，地网高张，百事无成，参商各别。须查门宫生旺墓败。狡童佚女，奸情杀伤。转盘时干克应：己加壬为“地网高张”：狡童佚女，奸情伤杀。正格：外害格。诀曰：“六乙加戊为外害，灾殃陡起在他乡”。又为支破格，诀曰：“支破即如庚加癸 ，谋为不就事虚然”。'

biangan['己癸'] = '遍干诀曰：“己加六癸性沉沦，地穴张罗祸事临。望喜求财皆不利，终防琐碎动哀音”。己加癸为地穴张罗格，明堂合华盖，地刑玄武。男女疾病垂危，词讼有囚狱之灾。转盘时干克应：己加癸为“地刑玄武”：男女疾病垂危，词讼有囚狱之灾。正格：外乱格。诀曰：“乙加己位为外乱，外国来兵要侵疆”。'

biangan['庚乙'] = '遍干诀曰：“太白贪合庚加乙，若求婚姻分外奇。合伙交游无不吉，安营下寨更相宜”。庚加乙为太白贪合格，诸事大吉，所为皆顺，太白蓬星，退吉进凶。转盘时干克应：庚加乙为“太白蓬星”：退吉进凶。正格：下合格，诀曰：“下合壬丁癸加戊 ，下恭于上上保安”。，又为合金格，诀曰：“上合乙庚甲与己，上亲于下下人欢”，又为合金格，诀曰：“合金钱财宜兵权”。又为外侵格，诀曰：“乙上加庚外侵局，外人欺我要提防”。'

biangan['庚丙'] = '遍干诀曰：“太白入荧大不利，官刑口舌被人欺。事属变动多又复，家里贼来窃资财”。天庚加地丙，为太白入荧格。诸事虽吉，费力方成，占贼必来，为官进利，为主破财。转盘时干克应：庚加丙为“太白入荧”：占贼必来，为客进利，为主破财。正格：内侵格，诀曰：“庚上加乙内侵格 ，家中欺我意不良”。'

biangan['庚丁'] = '遍干诀曰：“白入太阴庚加丁，谋为诸事若浮萍。妇女阴私情搅扰，始终无益且息停”。天庚加地丁，为太白入阴格，太白受刑。凡事不利，为庚改 亭亭叮咛之象。因私匿起讼，门吉有救。转盘时干克应：庚加丁为“亭亭之格”：因私暱起官司，门吉有救。正格：内害格，诀曰：“内害丙奇加在癸，是非口舌家内猖 ”。'

biangan['庚戊'] = '遍干诀曰：“庚金如或加戊上，太白乘龙姓名香。捕亡见阵征凶胜，驾木村天在野停”。天庚加地戊，为太白乘龙格，太白逢恩，太白天乙伏宫。百事不可谋为。转盘时干克应：庚加戊为“太白天乙伏宫”：百事不可谋为，凶。正格：乘权格，诀曰：“庚加戊字秉权格 ，假势兴隆大吉昌”。又为后间格，诀曰：“后间丁乙甲壬类，退后当中犯艰难”。'

biangan['庚己'] = '遍干诀曰：“鸣法遍干缺此格。转盘时干克应：庚加己为“刑格”：官司被重刑，诸事有阻遏。正格：得母格，诀曰：“庚加六己为得母，家中喜悦庆嘉祥”。'

biangan['庚庚'] = '遍干诀曰：“太白重重庚加庚，伏吟本属是原名。谋为内乱难行动，灾害提防自起兵”。庚加庚为太白重视格，太白重逢，太白同宫。官灾横祸，兄弟雷攻。转盘时干克应：庚加庚为“太白同宫”：官灾横祸，兄弟雷攻。又名“战格”。正格：伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['庚辛'] = '遍干诀曰：“天盘六庚加地辛，太白束虎显神威。刚正伏柔弱前进，自然百事庆福臻”。天庚加地辛，为太白束虎格，太白重刑，两强相峙，凡事必有争论。又为白虎干格，虎煞同宫，远行车折马死。转盘时干克应：庚加辛为“白虎干格”：远行必凶，车折马死。正格：进茹格，诀曰：“戊己庚辛壬下癸 ，进茹臧否喜来前”。'

biangan['庚壬'] = '遍干诀曰：“天盘六庚加地壬，太白入牢内事钦。人中少益多招损，诸般谋作费苦心”。天庚加地壬，为太白坐牢格。太白退位，凡事多疑。只宜敛迹。远行失迷道路 ，男女音信嗟呀。转盘时干克应：庚加壬为“上格”：远行失迷道路，男女音信嗟呀。正格：耗气格，诀曰：“耗气丙奇加六戊，我之财物不保全”。'

biangan['庚癸'] = '遍干诀曰：“六庚若然加地癸，寅申冲破不为祥。太白投罗事蹇滞，人情悖逆要谨防”。天庚加地癸，为太白履网格，又太白刑隔，诸事不宜。行人至，官司止，生产母子俱伤，门吉可救。转盘时干克应：庚加癸为“大格”：行人至，官司止，生产母子俱伤，大凶。正格：交阴格，诀曰：“丙加于己交阴象，隐匿阴私利伏藏”。又为支破格，诀曰：“支破即如庚加癸 ，谋为不就事虚然”。'

biangan['辛乙'] = '遍干诀曰：“辛与乙合虎猖狂，内中财破起灾殃。功名不遂出军败，所卜官非兴与亡”。天辛加地乙，为白虎猖狂格，家败人亡。走失破财，远行多殃，尊长不喜，车船俱伤。转盘时干克应：辛加乙为“白虎猖狂”：人亡家败，远行多殃，尊长不喜，车船俱伤。正格：外乱格。诀曰：“乙加己位为外乱，外国来兵要侵疆”。又为背冲格，诀曰：“背冲甲上庚相见，背地击攻可凯旋”。又为金冲格，诀曰：“金冲先要扬威武”'

biangan['辛丙'] = '遍干诀曰：“白虎逢朋格最良，天辛加在地丙乡。宜掌威权讨账目，秉介最善收钱粮”。辛加丙为白虎逢朋格，天庭得明，干合孛师。荧惑出现，占雨无，占晴旱，占事因财致讼。转盘时干克应：辛加丙为“干合悖师”：荧惑出现，占雨无，占晴旱，占事必因财致讼。正格：下合格，诀曰：“下合壬丁癸加戊 ，下恭于上上保安”。又为合水格，诀曰：“合水漂泊宜淫私”。'

biangan['辛丁'] = '遍干诀曰：“辛见丁字虎受伤，无终有始事乖张。家中耗散多竞闹，来问前程不共藏”。辛加丁为白虎受伤格，又狱神得奇。经商获倍利，囚人逢赦宥，凡事又有始无终多耗散。转盘时干克应：辛加丁为“狱神得奇”：经商获倍利，囚人逢赦宥。正格：内乱格，诀曰：“己加乙字内人乱，家里纷纷无主张”。'

biangan['辛戊'] = '遍干诀曰：“天辛加在 地盘戊，格取虎龙两争强。欲问求谋争多事，兴威举武是妙方”。辛加戊为虎龙争强格，诸事不和，求谋不通，困龙被伤，官司破败，屈抑守分。妄动祸殃。转盘时干克应：辛加戊为“困龙被伤”：官司破财，屈抑守分吉，越分妄动祸殃。正格：获父格，诀曰：“己加六丙谓获父 ，福德贵人在身旁”。又为支破格，诀曰：“支破即如庚加癸 ，谋为不就事虚然”。'

biangan['辛己'] = '遍干诀曰：“穴中虎卧诚非宜，辛字来临地己场。所求虽吉终劳力，聚草屯粮教武昌”。辛加己为虎卧穴中格，虎坐明堂，诸事隆吉，费力方成。入狱自刑，奴仆背主，词讼难申。转盘时干克应：辛加己为“入狱自刑”：奴仆背主，讼诉难伸。正格：倚势格，诀曰：“丁加于乙是倚势 ，赖侍他人我得扬”。又为后间格，诀曰：“后间丁乙甲壬类，退后当中犯艰难”。'

biangan['辛庚'] = '遍干诀曰：“若或六辛乘地庚，虎逢太白格不精。凡事惊疑多反复，居官革职业难成”。辛加庚为虎逢太白格，事主反复争论，进迫惊疑，白虎出力，主客相残。退避让步 ，不可强进。转盘时干克应：辛加庚为“白虎出力”：刀刃相接，主客相残。逊让退步稍可，强进血溅衣衫。正格：退茹格，诀曰：“辛庚己戊退茹是，休咎皆宜步回旋”。'

biangan['辛辛'] = '遍干诀曰：“二虎争锋辛加辛，伏吟格局莫求伸。有势难成皆自败，狐疑颠倒性非真”。辛加辛为二虎相争格，伏吟自刑，凡事自败，有势难行，进退猜疑。转盘时干克应：辛加辛为“伏吟天庭”：公废私就，讼狱自罹罪名。正格：伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['辛壬'] = '遍干诀曰：“虎入牢笼辛加壬，兴师不利被人擒。隐昧忧主无美策，须防诡诈起奸淫”。辛加壬为虎入牢笼格，天庭逢狱，凡事不利，所谋难成，防诈。凶蛇入狱，两男争女，先讼失理。转盘时干克应：辛加壬为“凶蛇入狱”：两男争女，讼狱不息，先动失理。正格：交阳格，诀曰：“丁加戊上交阳是 ，脱我精神我有伤”。'

biangan['辛癸'] = '遍干诀曰：“如或六辛加在癸，虎投罗网祸来侵。逢之守旧为最善，安分待时遁山林”。辛加癸为虎投罗网格，天牢华盖，日月失明，误入天网，动止乖张。转盘时干克应：辛加癸为“天牢华盖”：日月失明，误入天网，动止乖张。正格：夺权格。诀曰：“夺权如乙加丁位 ，我之权衡被人夺” 。前间格。诀曰：“乙丁壬甲前间格，进步中途有阻拦”。'

biangan['壬乙'] = '遍干诀曰：“天牢囚贵壬加乙，谋事有惊孕生子。动作营求口舌起，阴人得归成燕喜”。壬加乙为天牢囚贵格，不宜动作，日入九地，凡事不利。谋事多惊，占孕生子，禄马光华。转盘时干克应：壬加乙为“小蛇日奇”：女子柔顺，男人嗟叹。占孕生子，禄马光华。正格：交阴格，诀曰：“丙加于己交阴象，隐匿阴私利伏藏”。'

biangan['壬丙'] = '遍干诀曰：“天盘壬字加地丙，玄武相同入月里。谋动多凶惹词讼，皇宫慎备贼人起”。壬加丙为元武入狱格，天牢伏奇，水蛇入火，官灾刑禁，络绎不绝。凡事不利。转盘时干克应：壬加丙为“水蛇入火”：官灾刑禁，络绎不绝。正格：外制格，诀曰：“丙奇加庚为外制 ，他人欺辖隐钩铓”。又为背冲格，诀曰：“背冲甲上庚相见，背地击攻可凯旋”。又为水冲格，诀曰：“水冲行智并行船”。'

biangan['壬丁'] = '遍干诀曰：“六壬若或加地丁，元武谒贵求贤士。诸般得助利阴私，布阵埋兵须用诡”。壬加丁为元武谒贵格，太阴破狱，干合蛇刑，文书牵连，贵人匆匆，谋为暗昧利用阴私。转盘时干克应：壬加丁为“干合蛇刑”：文书牵连，贵人匆匆，女吉男凶。正格：下合格，诀曰：“下合壬丁癸加戊 ，下恭于上上保安”。又为合木格，诀曰：“合木发生宜市廛”。'

biangan['壬戊'] = '遍干诀曰：“玄武还有化龙格，天壬加临戊土中。最宜官讼求名事，演队交兵建旌旗”。壬加戊为元武化龙格，小蛇化龙，男人发达，女产婴童，凡事有始无终，求名吉。转盘时干克应：壬加戊为“小蛇化龙”：男人发达，女产婴童。正格：内制格，诀曰：“庚上加乙内侵格 ，家中欺我意不良”。'

biangan['壬己'] = '遍干诀曰：“六壬忽然又加己，元武深藏入穴时。夫妇家中多不睦，防备盗寇入房帏。天壬地己为元武入穴格，天地刑冲，凶蛇入户，大祸时至，诸事不成，顺守斯吉，词讼理曲。转盘时干克应：壬加己为“干合蛇刑”：大祸将至，顺守斯吉，词讼理屈。正格：内害格，诀曰：“内害丙奇加在癸，是非口舌家内猖 ”。又为支破格，诀曰：“支破即如庚加癸 ，谋为不就事虚然”。'

biangan['壬庚'] = '遍干诀曰：“元武倚势壬加庚，消化官非词讼平。内里惊慌多复反，凡谋进步始能精”。壬加庚为元武倚势格，天牢倚势，太白擒蛇，刑狱公平，立剖邪正，诸事不利，虚耗难成。转盘时干克应：壬加庚为“太白擒蛇”：刑狱公平，立剖邪正。正格：乘权格，诀曰：“庚加戊字 秉权格 ，假势兴隆大吉昌”。'

biangan['壬辛'] = '遍干诀曰：“若或壬辛同一位，元武乘虎任纵横。交战学武求名利，进禄加官衣锦荣”。壬加辛为玄武乘虎格。转盘时干克应：壬加辛为“螣蛇相缠”：纵得奇门，亦不能安。若有谋望，被人欺瞒。正格：得母格，诀曰：“庚加六己为得母，家中喜悦庆嘉祥”。'

biangan['壬壬'] = '遍干诀曰：“元武聚会伏吟格，原是壬壬归一营。破败之占谋不得，阴人费力若和平”。壬加壬为元武聚会格，天牢自刑，蛇入地罗，外人缠绕，内事索索。吉门吉星，庶免磋砣。转盘时干克应：壬加壬为“蛇入地罗”：外人缠绕，内事索索，吉门吉星，庶免磋砣。正格：伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['壬癸'] = '遍干诀曰：“玄神结义格最亨，天壬加癸一宫行。家中安乐人情顺，作用图谋事业成”。壬加癸为元武结义格，阴阳重地，门凶 迫制，幼女奸淫，家有丑声。凡事不宜图谋，计穷之象。转盘时干克应：壬加癸为“幼女奸淫”：家有丑声，门星俱吉，反祸福隆。正格：进茹格，诀曰：“戊己庚辛壬下癸 ，进茹臧否喜来前”。'

biangan['癸乙'] = '遍干诀曰：“天罗蔽日灾横起，交战必然两地凶。盗窃中途须防备，癸同乙木一宫逢”。天癸加地乙，为天罗蔽日格，日沉九地，华盖蓬星，吉门生助，诸事有益，阳贵相扶，贵人禄位，常人平安。转盘时干克应：癸加乙为“华盖蓬星”：贵人禄位，常人平安。正格：夺权格。诀曰：“夺权如乙加丁位 ，我之权衡被人夺” 。又为前间格。诀曰：“乙丁壬甲前间格，进步中途有阻拦”。'

biangan['癸丙'] = '遍干诀曰：“螣蛇侵月格最凶，癸加丙干是奇功。须知大盗如蜂起，口舌牵连家败风”。天癸加地丙，为螣蛇侵月格，又明堂犯孛，华盖孛师。吉门和义，诸事称遂，贵贱逢之，上人见喜。转盘时干克应：癸加丙为“华盖孛师”：贵贱逢之，上人见喜。正格：外害格。诀曰：“六乙加戊为外害，灾殃陡起在他乡”。'

biangan['癸丁'] = '遍干诀曰：“螣蛇妖娇癸加丁，官事失财家不宁。火怪飞灾连结至，邪魔鬼祟闹门庭”。癸加丁为螣蛇妖娇凶格，百事不吉返凶，无主意，文书官灾，火焚莫逃。转盘时干克应：癸加丁为“螣蛇夭矫”：文书官司，火焚莫逃。正格：外乱格。诀曰：“乙加己位为外乱，外国来兵要侵疆”。又为背冲格，诀曰：“背冲甲上庚相见，背地击攻可凯旋”。又为水冲格，诀曰：“水冲行智并行船”。'

biangan['癸戊'] = '遍干诀曰：“六癸如然加在戊，螣蛇格号交龙铭。伏兵动作须持火，私和阴谋妙通灵”。癸加戊为螣蛇交龙格，又天乙会合格，财喜婚姻，吉人赞助成合。若门凶破迫制，未免官非恩怨。转盘时干克应：癸加戊为“天乙会合”：吉格，财喜婚姻，吉人赞助成合。若门凶迫制，反祸官非。正格：内侵格，诀曰：“庚上加乙内侵格 ，家中欺我意不良”。又为下合格，诀曰：“下合壬丁癸加戊 ，下恭于上上保安”。又为合火格，诀曰：“合火文书与音信，功名筹策宜聘贤”。'

biangan['癸己'] = '遍干诀曰：“螣蛇入穴两相交，天癸加于地己巢。凡谋不遂心和意，守旧安常勿动敲”。癸加己为螣蛇入穴格，又华盖入明堂，华盖地户。凡事虽吉，不无耗散，音信皆阻，躲灾避难吉 。转盘时干克应：癸加己为“华盖地户”：男女占之，音信皆阻，躲灾避难为吉。正格：内乱格，诀曰：“己加乙字内人乱，家里纷纷无主张”。'

biangan['癸庚'] = '遍干诀曰：“网罗太白何言利，癸水庚金一度标。先易后难其应事，格中暌阻不相聊。癸水加庚金，为网罗太白格，又名太白入网，作事刑害，求谋无益，以暴争讼力平。转盘时干克应：癸加庚为“太白入网”：以暴争讼力平。正格：获父格，诀曰：“己加六丙谓获父 ，福德贵人在身旁”。又为支破格，诀曰：“支破即如庚加癸 ，谋为不就事虚然”。'

biangan['癸辛'] = '遍干诀曰：“癸干若入辛金地，乘虎蛇神格最超。诸事遂心安且乐，飞灾横祸霁时消”。癸加辛为蛇神乘虎格，又华盖受恩，网盖天牢，占病死，占讼死罪难逃。转盘时干克应：癸加辛为“网盖天牢”：占病占讼，死罪莫逃。正格：倚势格，诀曰：“丁加于乙是倚势 ，赖侍他人我得扬”。又为后间格，诀曰：“后间丁乙甲壬类，退后当中犯艰难”。'

biangan['癸壬'] = '遍干诀曰：“六仪有个蛇入牢，癸壬 之宫罪何逃。事多反复妻停续，回脚行来往最高”。癸加壬为螣蛇入牢格，又天网覆狱，复见螣蛇，凡谋不利。上下蒙蔽，暗昧不明，退守为吉。转盘时干克应：癸加壬为“复见螣蛇”：嫁娶重婚，后嫁无子，不保年华。正格：退茹格，诀曰：“辛庚己戊退茹是，休咎皆宜步回旋”。'

biangan['癸癸'] = '遍干诀曰：“天网四张癸癸来，重重关锁钥难开。XX 隐匿私通利，进退狐疑意徘徊”。癸加癸为罗网重张格，天网四张无路走，凡事闭塞冤屈难伸，行人失伴，病讼皆伤。转盘时干克应：癸加癸为“天网四张”：行人失伴，病讼皆伤。正格：外侵格，诀曰：“乙上加庚外侵局，外人欺我要提防”。伏吟格，诀曰：“蓬星坎兮景门九，戊戊己己伏吟名。只宜静守不宜动，非灾即祸俱来克”。'

biangan['甲己'] = '遍干诀曰：“甲加己为“贵人入狱”，凡占公私皆不利，又为青龙相合。正格：'
