function wubuyushi(s,r){

	s = s%10
	r = r%10

	if (s==1 && r ==5){
		return "T"
	}

	if (s==2 && r ==6){
		return "T"
	}

	if (s==3 && r ==7){
		return "T"
	}

	if (s==4 && r ==8){
		return "T"
	}

	if (s==5 && r ==9){
		return "T"
	}

	if (s==6 && r ==0){
		return "T"
	}

	if (s==7 && r ==1){
		return "T"
	}

	if (s==8 && r ==2){
		return "T"
	}

	if (s==9 && r ==3){
		return "T"
	}

	if (s==0 && r ==4){
		return "T"
	}

	return "F"
}

var shigan_keying = new Array(100)

shigan_keying['乙甲'] = '乙加甲为“奇入天门”，万事皆旺，三门会合吉，门逢凶迫，不利。'

shigan_keying['乙乙'] = '乙加乙为“日奇伏吟”：不宜谒贵求名，只可安分守身。'

shigan_keying['乙丙'] = '乙加丙为“奇仪顺遂”：吉星为迁官进职；凶星为夫妻别离。'

shigan_keying['乙丁'] = '乙加丁为“奇仪相佐”：文书事吉，百事可为。'

shigan_keying['乙戊'] = '乙加戊为“利阴害阳”：门逢凶迫，财破人伤。'

shigan_keying['乙己'] = '乙加己为“日奇入雾”：被土暗昧，门凶必凶；得开门为地遁。'

shigan_keying['乙庚'] = '乙加庚为“日奇被刑”：争讼败产，夫妻怀私。'

shigan_keying['乙辛'] = '乙加辛为“青龙逃走”：奴仆拐带，六畜皆伤。'

shigan_keying['乙壬'] = '乙加壬为“日奇入地”：尊卑悖乱，官讼是非。'

shigan_keying['乙癸'] = '乙加癸为“华盖青龙”：遁迹修道，隐匿藏形，避灾避难为吉。又名“华盖逢星官”。'

shigan_keying['丙乙'] = '丙加乙为“日月并行”：公谋私为皆吉。'

shigan_keying['丙丙'] = '丙加丙为“月奇孛师”：文书逼迫，破耗遗失。'

shigan_keying['丙丁'] = '丙加丁为“月奇朱雀”：贵人文书吉利，常人平静。得生门为天遁。'

shigan_keying['丙戊'] = '丙加戊为“飞鸟跌穴”：谋为百事，吉顺洞彻。'

shigan_keying['丙己'] = '丙加己为“火孛入刑”：囚人刑杖，文书不行。吉门得吉，凶门转凶。'

shigan_keying['丙庚'] = '丙加庚为“荧入太白”：门户破败，盗贼耗失。'

shigan_keying['丙辛'] = '丙加辛为“奇神相合”：谋事成就，病人不凶。'

shigan_keying['丙壬'] = '丙加壬为“火入天罗”：为客不利，是非颇多。'

shigan_keying['丙癸'] = '丙加癸为“华盖悖师”：阴人害事，灾祸频生。'

shigan_keying['丁乙'] = '丁加乙为“人遁吉格”：贵人加官进爵，常人婚姻财喜。'

shigan_keying['丁丙'] = '丁加丙为“星随月转”：贵人越级高升；常人乐中生悲。'

shigan_keying['丁丁'] = '丁加丁为“奇入太阴”：文书即至，喜事遂心。'

shigan_keying['丁戊'] = '丁加戊为“青龙转光”：贵人升迁，常人咸昌。'

shigan_keying['丁己'] = '丁加己为“火入勾陈”：奸私仇冤，事因女人。'

shigan_keying['丁庚'] = '丁加庚为“年月日时格”，文书阻隔，行人必归。'

shigan_keying['丁辛'] = '丁加辛为“朱雀入狱”：罪人释囚，官人失位。'

shigan_keying['丁壬'] = '丁加壬为“五神互合”：贵人恩诏，讼狱公平。'

shigan_keying['丁癸'] = '丁加癸为“朱雀投江”：文书口舌俱消，音信沉溺。'

shigan_keying['戊乙'] = '戊加乙为“青龙合灵”：门吉事吉，门凶事凶。'

shigan_keying['戊丙'] = '戊加丙为“青龙反首”：动作大吉，迫墓击刑，吉事成凶。'

shigan_keying['戊丁'] = '戊加丁为“青龙耀明”：谒贵求名吉利；若值墓迫，惹是招非。'

shigan_keying['戊戊'] = '戊加戊为“伏吟”：凡事闭塞阻滞，静守为吉。'

shigan_keying['戊己'] = '戊加己为“贵人入狱”：公私皆不利。'

shigan_keying['戊庚'] = '戊加庚为“值符飞宫”：吉事不吉，凶事更凶。'

shigan_keying['戊辛'] = '戊加辛为“青龙折足”：吉门生助，尚可谋为，若逢凶门，拐带失财，兼有足疾。'

shigan_keying['戊壬'] = '戊加壬为“龙入天牢”：凡阴阳皆不吉利。'

shigan_keying['戊癸'] = '戊加癸为“青龙华盖”：门吉招福，门凶多乖。'

shigan_keying['己乙'] = '己加乙为“墓神不明”：地户蓬星，宜遁迹隐形为利。'

shigan_keying['己丙'] = '己加丙为“火悖地户”：阳人冤冤相害，阴人必致淫污。'

shigan_keying['己丁'] = '己加丁为“朱雀入墓”：文状词讼，先曲后直。'

shigan_keying['己戊'] = '己加戊为“犬遇青龙”：门吉谋望遂意，上人见喜；门凶枉劳心机。'

shigan_keying['己己'] = '己加己为“地户逢鬼”：病者必死，百事不遂。'

shigan_keying['己庚'] = '己加庚为“刑格反名”：词讼先动者不利，阴星有谋害之情。'

shigan_keying['己辛'] = '己加辛为“游魂入墓”：大人鬼魅，小人家先为祟，凶。'

shigan_keying['己壬'] = '己加壬为“地网高张”：狡童佚女，奸情伤杀。'

shigan_keying['己癸'] = '己加癸为“地刑玄武”：男女疾病垂危，词讼有囚狱之灾。'

shigan_keying['庚乙'] = '庚加乙为“太白蓬星”：退吉进凶。'

shigan_keying['庚丙'] = '庚加丙为“太白入荧”：占贼必来，为客进利，为主破财。'

shigan_keying['庚丁'] = '庚加丁为“亭亭之格”：因私暱起官司，门吉有救。'

shigan_keying['庚戊'] = '庚加戊为“太白天乙伏宫”：百事不可谋为，凶。'

shigan_keying['庚己'] = '庚加己为“刑格”：官司被重刑，诸事有阻遏。'

shigan_keying['庚庚'] = '庚加庚为“太白同宫”：官灾横祸，兄弟雷攻。又名“战格”。'

shigan_keying['庚辛'] = '庚加辛为“白虎干格”：远行必凶，车折马死。'

shigan_keying['庚壬'] = '庚加壬为“上格”：远行失迷道路，男女音信嗟呀。'

shigan_keying['庚癸'] = '庚加癸为“大格”：行人至，官司止，生产母子俱伤，大凶。'

shigan_keying['辛乙'] = '辛加乙为“白虎猖狂”：人亡家败，远行多殃，尊长不喜，车船俱伤。'

shigan_keying['辛丙'] = '辛加丙为“干合悖师”：荧惑出现，占雨无，占晴旱，占事必因财致讼。'

shigan_keying['辛丁'] = '辛加丁为“狱神得奇”：经商获倍利，囚人逢赦宥。'

shigan_keying['辛戊'] = '辛加戊为“困龙被伤”：官司破财，屈抑守分吉，越分妄动祸殃。'

shigan_keying['辛己'] = '辛加己为“入狱自刑”：奴仆背主，讼诉难伸。'

shigan_keying['辛庚'] = '辛加庚为“白虎出力”：刀刃相接，主客相残。逊让退步稍可，强进血溅衣衫。'

shigan_keying['辛辛'] = '辛加辛为“伏吟天庭”：公废私就，讼狱自罹罪名。'

shigan_keying['辛壬'] = '辛加壬为“凶蛇入狱”：两男争女，讼狱不息，先动失理。'

shigan_keying['辛癸'] = '辛加癸为“天牢华盖”：日月失明，误入天网，动止乖张。'

shigan_keying['壬乙'] = '壬加乙为“小蛇日奇”：女子柔顺，男人嗟叹。占孕生子，禄马光华。'

shigan_keying['壬丙'] = '壬加丙为“水蛇入火”：官灾刑禁，络绎不绝。'

shigan_keying['壬丁'] = '壬加丁为“干合蛇刑”：文书牵连，贵人匆匆，女吉男凶。'

shigan_keying['壬戊'] = '壬加戊为“小蛇化龙”：男人发达，女产婴童。'

shigan_keying['壬己'] = '壬加己为“干合蛇刑”：大祸将至，顺守斯吉，词讼理屈。'

shigan_keying['壬庚'] = '壬加庚为“太白擒蛇”：刑狱公平，立剖邪正。'

shigan_keying['壬辛'] = '壬加辛为“螣蛇相缠”：纵得奇门，亦不能安。若有谋望，被人欺瞒。'

shigan_keying['壬壬'] = '壬加壬为“蛇入地罗”：外人缠绕，内事索索，吉门吉星，庶免磋砣。'

shigan_keying['壬癸'] = '壬加癸为“幼女奸淫”：家有丑声，门星俱吉，反祸福隆。'

shigan_keying['癸乙'] = '癸加乙为“华盖蓬星”：贵人禄位，常人平安。'

shigan_keying['癸丙'] = '癸加丙为“华盖孛师”：贵贱逢之，上人见喜。'

shigan_keying['癸丁'] = '癸加丁为“螣蛇夭矫”：文书官司，火焚莫逃。'

shigan_keying['癸戊'] = '癸加戊为“天乙会合”：吉格，财喜婚姻，吉人赞助成合。若门凶迫制，反祸官非。'

shigan_keying['癸己'] = '癸加己为“华盖地户”：男女占之，音信皆阻，躲灾避难为吉。'

shigan_keying['癸庚'] = '癸加庚为“太白入网”：以暴争讼力平。'

shigan_keying['癸辛'] = '癸加辛为“网盖天牢”：占病占讼，死罪莫逃。'

shigan_keying['癸壬'] = '癸加壬为“复见螣蛇”：嫁娶重婚，后嫁无子，不保年华。'

shigan_keying['癸癸'] = '癸加癸为“天网四张”：行人失伴，病讼皆伤。'

shigan_keying['甲己'] = '甲加己为“贵人入狱”，凡占公私皆不利，又为青龙相合。'
